Tekla Open API Reference for Tekla Structures 2025
Picker.PickPoint Method (String, Point, ViewBase)
 Requests the user to pick one point.
 Namespace: Tekla.Structures.Drawing.UI
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public void PickPoint(
	string prompt,
	out Point pickedPoint,
	out ViewBase pickedView
)
Public Sub PickPoint (
	prompt As String,
	<OutAttribute> ByRef pickedPoint As Point,
	<OutAttribute> ByRef pickedView As ViewBase
)
Parameters
prompt
Type: System.String
The prompt shown in the status bar. See the class remarks for more information about prompts.
pickedPoint
Type: Tekla.Structures.Geometry3d.Point
The picked point in the view coordinates.
pickedView
Type: Tekla.Structures.Drawing.ViewBase
The view in which the pick occurred.
Exceptions
Exception | Condition
InvalidPluginPickerInputException |  Thrown when the picker is being used through a plug-in which has invalid PluginPickerInputs defined.
PickerInterruptedException |  Thrown when the user interrupts the picker before anything has been picked.
See Also
Reference
Picker Class
PickPoint Overload
Tekla.Structures.Drawing.UI Namespace